docs/corners/david/data-oriented.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data-Oriented Design and C++</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Data-Oriented Design and C++</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-27 Mon 11:51</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='lowlevel.html'>Low-Level Programming</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#orgc9570b3">1. What is Data-Oriented Design?</a>
<ul>
<li><a href="#org42583f3">1.1. Three Big Lies</a>
<ul>
<li><a href="#orgf0d8c2d">1.1.1. Software is a platform.</a></li>
<li><a href="#orge0d8252">1.1.2. Code should be designed around your mental model of the world.</a></li>
<li><a href="#orgee3e43d">1.1.3. Code is more important than data.</a></li>
</ul>
</li>
<li><a href="#org00fbcde">1.2. Results of TBL</a></li>
</ul>
</li>
<li><a href="#org0003c13">2. Example: Dictionary Lookup</a>
<ul>
<li><a href="#org8b87839">2.1. Code-First design</a></li>
<li><a href="#orgf72c54c">2.2. Data-First design</a></li>
</ul>
</li>
<li><a href="#orge743e2b">3. Cache Times</a></li>
<li><a href="#org07486da">4. Improvements</a></li>
<li><a href="#org13de833">5. Questions</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-orgc9570b3" class="outline-2">
<h2 id="orgc9570b3"><span class="section-number-2">1</span> What is Data-Oriented Design?</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>The purpose of all programs is to transform data.</i> 
</p>

<ul class="org-ul">
<li>If you don't understand the data you're working with, you don't understand the problem (and conversely, understanding it more means you understand the problem).</li>
<li>Also, different data = different problems.</li>
<li>Understanding the problem also relies on understanding the cost of the things you're doing (and therefore hardware as well).</li>
<li>Optimizing on problems you probably don't have creates problems you do.</li>
<li>More context, better solution. Data is important for this.</li>
<li>Reason must prevail - pragmatism over theory.</li>
</ul>
</div>
<div id="outline-container-org42583f3" class="outline-3">
<h3 id="org42583f3"><span class="section-number-3">1.1</span> Three Big Lies</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf0d8c2d" class="outline-4">
<h4 id="orgf0d8c2d"><span class="section-number-4">1.1.1</span> Software is a platform.</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Obviously hardware is the platform, and solutions are different for different sets of hardware. x86 vs ARM is different due to varying constraints (and therefore you need to consider <a href="lowlevel.html">low-level</a> things). Reality is not something you're forced to deal with but the actual problem itself (pragmatism &gt; theory).
</p>
</div>
</div>
<div id="outline-container-orge0d8252" class="outline-4">
<h4 id="orge0d8252"><span class="section-number-4">1.1.2</span> Code should be designed around your mental model of the world.</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This ends up hiding data - and that's bad since trading maintenance for understanding of the data makes the problem harder to solve. Classes are similar in real life but not in code so you end up with strange monolithic and unrelated data structures. Too abstract of a solution and divorced from reality.
</p>
</div>
</div>
<div id="outline-container-orgee3e43d" class="outline-4">
<h4 id="orgee3e43d"><span class="section-number-4">1.1.3</span> Code is more important than data.</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Code is only for transforming data. Programmers are responsible for solving data transformation problems, not just writing code. And in order to do solve these problems you need to understand the data, and idealized abstract solutions don't work since they ignore the <b>actual</b> data you're working with.
</p>
</div>
</div>
</div>
<div id="outline-container-org00fbcde" class="outline-3">
<h3 id="org00fbcde"><span class="section-number-3">1.2</span> Results of TBL</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Poor performance</li>
<li>Poor concurrency</li>
<li>Poor optimizability</li>
<li>Poor stability</li>
<li>Poor testability</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0003c13" class="outline-2">
<h2 id="org0003c13"><span class="section-number-2">2</span> Example: Dictionary Lookup</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8b87839" class="outline-3">
<h3 id="org8b87839"><span class="section-number-3">2.1</span> Code-First design</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Something like this in memory, since we view these as being associated with each other:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Key</td>
<td class="org-left">Value</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
This isn't actually the case. Most of the time it's only the keys that matter since those are used for the lookup. This kills performance since now you're loading the value into the cache each time only to immediately throw it away.
</p>
</div>
</div>
<div id="outline-container-orgf72c54c" class="outline-3">
<h3 id="orgf72c54c"><span class="section-number-3">2.2</span> Data-First design</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Have them separate, and only the keys will be in cache (yes the value will be a cold lookup that causes a cache miss, but the statistical chance is low). <i>Always solve for the common case first.</i>
</p>
</div>
</div>
</div>
<div id="outline-container-orge743e2b" class="outline-2">
<h2 id="orge743e2b"><span class="section-number-2">3</span> Cache Times</h2>
<div class="outline-text-2" id="text-3">
<p>
The most expensive operations are transcendentals at ~100 cycles and square roots at ~25 cycles. In comparison, L1 lookups take 3, L2 take 20+, and RAM 300+ cycles. L1 is great, L2 is decent, and RAM is painfully slow. Because of this, this means L2 cache misses are the most important events when it comes to understanding performance. 
</p>

<p>
The compiler spends its time optimizing everything besides the waiting times for cache lines - because it <i>can't</i> solve them.
</p>
</div>
</div>
<div id="outline-container-org07486da" class="outline-2">
<h2 id="org07486da"><span class="section-number-2">4</span> Improvements</h2>
<div class="outline-text-2" id="text-4">
<p>
:collapsed: true
</p>
<ul class="org-ul">
<li>Make sure the whole line is filled with data: make the most out of your reads.
<ul class="org-ul">
<li>Things don't just exist in a void most of the time so make sure to pack them together to achieve this.</li>
</ul></li>
<li>Don't put bools in structs - very low information density so cache is wasted and this likely bumps other more important things beyond the cache</li>
<li>Compilers aren't amazing at optimizing reads/writes - so make sure to not perform unnecessary ones.</li>
<li>"Hoist" (bring the the outside) all loop invariants (even simple ones)</li>
</ul>


<p>
Want to see information density of bools? Just dump value and compress it.
</p>
</div>
</div>
<div id="outline-container-org13de833" class="outline-2">
<h2 id="org13de833"><span class="section-number-2">5</span> Questions</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>How do you avoid code duplication without STL/templates?
<ul class="org-ul">
<li>It's not that large of a problem, but ultimately you can just generate the code.</li>
</ul></li>
<li>How do you deal with variety of platforms and the situations your code will be run in?
<ul class="org-ul">
<li>Unlikely that the range if very large and that you don't knnow anything.</li>
</ul></li>
<li>What about non performance-heavy industries?
<ul class="org-ul">
<li>Performance matters everywhere, even to users.</li>
</ul></li>
<li>What about portability?
<ul class="org-ul">
<li>Optimize for a specific range.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
